# Linear regression

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
from scipy import stats

In [4]:
from sklearn.preprocessing import StandardScaler

In [5]:
from sklearn.linear_model import LinearRegression

In [6]:
from sklearn.model_selection import train_test_split

In [7]:
from sklearn.metrics import r2_score, mean_squared_error, mean_absolute_error

## Advertising dataset

In [8]:
df = pd.read_csv('data/Advertising.csv')

In [9]:
df.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

## House prices dataset

In [10]:
df = pd.read_csv('data/house_prices_reg.csv')

In [11]:
df.head()

      barrio  num_rooms         m2         price
0   Ensanche          3  24.335644  48672.288187
1  Milagrosa          2  10.113852  15171.778541
2   Ensanche          2  20.227705  40456.409363
3   Ensanche          2  20.227705  40456.409483
4   Iturrama          2  30.341557  91025.671007